dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEmem_mpu_bf.h
/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN50 */
#define IFX_EMEM_MPU_ACCEN1_EN50_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN50 */
#define IFX_EMEM_MPU_ACCEN1_EN50_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN50 */
#define IFX_EMEM_MPU_ACCEN1_EN50_OFF (18u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN51 */
#define IFX_EMEM_MPU_ACCEN1_EN51_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN51 */
#define IFX_EMEM_MPU_ACCEN1_EN51_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN51 */
#define IFX_EMEM_MPU_ACCEN1_EN51_OFF (19u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN52 */
#define IFX_EMEM_MPU_ACCEN1_EN52_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN52 */
#define IFX_EMEM_MPU_ACCEN1_EN52_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN52 */
#define IFX_EMEM_MPU_ACCEN1_EN52_OFF (20u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN53 */
#define IFX_EMEM_MPU_ACCEN1_EN53_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN53 */
#define IFX_EMEM_MPU_ACCEN1_EN53_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN53 */
#define IFX_EMEM_MPU_ACCEN1_EN53_OFF (21u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN54 */
#define IFX_EMEM_MPU_ACCEN1_EN54_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN54 */
#define IFX_EMEM_MPU_ACCEN1_EN54_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN54 */
#define IFX_EMEM_MPU_ACCEN1_EN54_OFF (22u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN55 */
#define IFX_EMEM_MPU_ACCEN1_EN55_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN55 */
#define IFX_EMEM_MPU_ACCEN1_EN55_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN55 */
#define IFX_EMEM_MPU_ACCEN1_EN55_OFF (23u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN56 */
#define IFX_EMEM_MPU_ACCEN1_EN56_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN56 */
#define IFX_EMEM_MPU_ACCEN1_EN56_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN56 */
#define IFX_EMEM_MPU_ACCEN1_EN56_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_LEN (1u)

