dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEmem_mpu_bf.h
/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_LEN (27u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_LEN (27u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN2 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN2_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN3 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN3_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN4 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN4_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN5 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN5_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN6 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN6_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN7 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN7_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN8 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN8_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN9 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN9_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN10 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN10_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN11 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN11_LEN (1u)

